# GetPredefinedSetupNames Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions..::..GetPredefinedSetupNames Method
DGNExportOptions Class See Also
---
Returns a list of names of predefined setups of DGN export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<string> GetPredefinedSetupNames(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetPredefinedSetupNames ( _
	document As Document _
) As IList(Of String)
```

Visual C++
---
```text
public:
static IList<String^>^ GetPredefinedSetupNames(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document A Revit document to retrieve names from.
# ### Return Value
An array of strings representing names of predefined setups.
# Remarks
To get predefined options in the desired format use the static method getPredefinedOptions defined in DGNExportOptions.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace